iarsystems/ewarm-toshiba-example-projects/TMPM4G7/Libraries/startup/startup_TMPM4G7.s
                PUBWEAK INTT32A03_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A03_A_CT_IRQHandler
                B       INTT32A03_A_CT_IRQHandler

                PUBWEAK INTT32A03_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A03_B_C01_CPC_IRQHandler
                B       INTT32A03_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A04_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04_A_CT_IRQHandler
                B       INTT32A04_A_CT_IRQHandler

                PUBWEAK INTT32A04_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A04_B_C01_CPC_IRQHandler
                B       INTT32A04_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A05_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05_A_CT_IRQHandler
                B       INTT32A05_A_CT_IRQHandler

                PUBWEAK INTT32A05_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A05_B_C01_CPC_IRQHandler
                B       INTT32A05_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A06_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06_A_CT_IRQHandler
                B       INTT32A06_A_CT_IRQHandler

                PUBWEAK INTT32A06_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A06_B_C01_CPC_IRQHandler
                B       INTT32A06_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A07_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07_A_CT_IRQHandler
                B       INTT32A07_A_CT_IRQHandler

                PUBWEAK INTT32A07_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A07_B_C01_CPC_IRQHandler
                B       INTT32A07_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A08_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A08_A_CT_IRQHandler
                B       INTT32A08_A_CT_IRQHandler

                PUBWEAK INTT32A08_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A08_B_C01_CPC_IRQHandler
                B       INTT32A08_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A09_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A09_A_CT_IRQHandler
                B       INTT32A09_A_CT_IRQHandler

                PUBWEAK INTT32A09_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A09_B_C01_CPC_IRQHandler
                B       INTT32A09_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A10_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A10_A_CT_IRQHandler
                B       INTT32A10_A_CT_IRQHandler

                PUBWEAK INTT32A10_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A10_B_C01_CPC_IRQHandler
                B       INTT32A10_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A11_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A11_A_CT_IRQHandler
                B       INTT32A11_A_CT_IRQHandler

                PUBWEAK INTT32A11_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A11_B_C01_CPC_IRQHandler
                B       INTT32A11_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A12_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A12_A_CT_IRQHandler
                B       INTT32A12_A_CT_IRQHandler

                PUBWEAK INTT32A12_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A12_B_C01_CPC_IRQHandler
                B       INTT32A12_B_C01_CPC_IRQHandler

                PUBWEAK INTT32A13_A_CT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A13_A_CT_IRQHandler
                B       INTT32A13_A_CT_IRQHandler

                PUBWEAK INTT32A13_B_C01_CPC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A13_B_C01_CPC_IRQHandler
                B       INTT32A13_B_C01_CPC_IRQHandler

                PUBWEAK INTEMG0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTEMG0_IRQHandler
                B       INTEMG0_IRQHandler

                PUBWEAK INTOVV0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTOVV0_IRQHandler
                B       INTOVV0_IRQHandler

                PUBWEAK INTPWM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTPWM0_IRQHandler
                B       INTPWM0_IRQHandler

                PUBWEAK INTT0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT0RX_IRQHandler
                B       INTT0RX_IRQHandler

                PUBWEAK INTT0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT0TX_IRQHandler
                B       INTT0TX_IRQHandler

                PUBWEAK INTT0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT0ERR_IRQHandler
                B       INTT0ERR_IRQHandler

                PUBWEAK INTT1RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT1RX_IRQHandler
                B       INTT1RX_IRQHandler

                PUBWEAK INTT1TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT1TX_IRQHandler
                B       INTT1TX_IRQHandler

                PUBWEAK INTT1ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT1ERR_IRQHandler
                B       INTT1ERR_IRQHandler

                PUBWEAK INTT2RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT2RX_IRQHandler
                B       INTT2RX_IRQHandler

                PUBWEAK INTT2TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT2TX_IRQHandler
                B       INTT2TX_IRQHandler

                PUBWEAK INTT2ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT2ERR_IRQHandler
                B       INTT2ERR_IRQHandler

